In [1]:
import mysql.connector
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('mysql+mysqlconnector://admin:admin@localhost/sakila')

In [3]:
# Nomor 1
pd.read_sql_query('''
SELECT
	f.title AS title,
    c.name AS category,
    f.length AS length
FROM film f 
	JOIN
film_category fc ON f.film_id = fc.film_id
	JOIN
category c ON fc.category_id = c.category_id
WHERE c.name = 'Comedy'
ORDER BY length ASC
LIMIT 10;
''', engine)

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

In [4]:
# Nomor 2
pd.read_sql_query('''
SELECT 
	c.name AS kategori,
    COUNT(fc.film_id) AS jumlahMovie
FROM film f
	JOIN
film_category fc ON f.film_id = fc.film_id
	JOIN
category c ON fc.category_id = c.category_id
GROUP BY fc.category_id
ORDER BY jumlahMovie DESC;
''', engine)

# HARUSNYA dijoin lagi sama amount di table payment tapi hasilnya jadi berantakan jadi saya sampe sini mas.

       kategori  jumlahMovie
0        Sports           74
1       Foreign           73
2        Family           69
3   Documentary           68
4     Animation           66
5        Action           64
6           New           63
7         Drama           62
8         Games           61
9        Sci-Fi           61
10     Children           60
11       Comedy           58
12     Classics           57
13       Travel           57
14       Horror           56
15        Music           51

In [5]:
# Nomor 3
pd.read_sql_query('''
SELECT 
	a.actor_id AS actor_id,
    a.first_name AS first_name,
    a.last_name AS last_name,
    COUNT(fa.film_id) AS jumlah_Movie 
FROM film f
	JOIN
film_actor fa ON f.film_id = fa.film_id
	JOIN
actor a ON a.actor_id = fa.actor_id
GROUP BY fa.actor_id
ORDER BY  COUNT(fa.film_id) DESC
LIMIT 10;
''', engine)

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

In [6]:
# Nomor 4
pd.read_sql_query('''
SELECT
    c.name AS kategori,
    COUNT(c.name) AS jumlah_Movie
FROM film f
	JOIN
film_actor fa ON f.film_id = fa.film_id
	JOIN
film_category fc ON f.film_id = fc.film_id
	JOIN 
category c ON fc.category_id = c.category_id
WHERE fa.actor_id = 107
GROUP BY c.name;
''', engine)

       kategori  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

In [7]:
# Nomor 5
pd.read_sql_query('''
SELECT
	f.title AS title,
    c.name AS category
FROM film f
	JOIN
film_actor fa ON f.film_id = fa.film_id
	JOIN
film_category fc ON f.film_id = fc.film_id
	JOIN 
category c ON fc.category_id = c.category_id
WHERE fa.actor_id = 107 AND c.name = 'Sci-Fi'
''', engine)

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi